# Week 6: Combining dataframe

When working with multiple datasets during a project, there will come a point where you might wish to merge your dataframes together to have a better view and understanding of your data. 

In this tutorial, we will cover two pandas functions, and they are [concat](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.concat.html) and [merge](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html) that are used to combine dataframes.

Note that you sometimes you will might see functions like [join](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.join.html) and [append](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.append.html#pandas.DataFrame.append) being used in other people's notebooks. However, I will not be discussing these two functions but just know they are the equivalent of concat and merge respectively.

I would recommend that you only learn concat and merge as they should be sufficient to handle all the scenarios that you will ever come across.

With that being said, let's proceed with the tutorial.

# Import pandas

In [1]:
import pandas as pd

# Concat

Concat is short for concatenate. This function allows to stack two separate dataframes both vertically and horizontally.

Let's observe this with an example.

In [2]:
df1 = pd.DataFrame({'Name': ['Vicky', 'Bill'], 'Age': [12, 46]})
df2 = pd.DataFrame({'Name': ['John', 'Sabrina'], 'Age': [37, 25]})
df1

    Name  Age
0  Vicky   12
1   Bill   46

In [3]:
df2

      Name  Age
0     John   37
1  Sabrina   25

There is an argument called axis within the concat function that you can use to specify which way you would like to stack your dataframe. 1 means horizontal whereas 0 means vertical. If you do not specify, pandas assumes 0 as its default. 

You can also use the ignore index function if you would like a sequential index column in the new dataframe.

In [4]:
# Concat horizontally

pd.concat([df1, df2], axis = 1)

    Name  Age     Name  Age
0  Vicky   12     John   37
1   Bill   46  Sabrina   25

In [5]:
# Concat vertically and ignore index

df3 = pd.concat([df1, df2], axis = 0)
df3

      Name  Age
0    Vicky   12
1     Bill   46
0     John   37
1  Sabrina   25

There is another argument called join which allows you to stack dataframes only based on the columns shared by two dataframes.

To demonstrate this, suppose we have a new dataframe with an extra column for hobby.

In [6]:
df4 = pd.DataFrame({'Name': ['Tyler', 'Natalie'], 'Age': [28, 39], 'Hobby': ['Swimming', 'Reading']})
df4

      Name  Age     Hobby
0    Tyler   28  Swimming
1  Natalie   39   Reading

In [7]:
# Outer is the default for the join argument

pd.concat([df3, df4], join = 'outer', ignore_index = True)

      Name  Age     Hobby
0    Vicky   12       NaN
1     Bill   46       NaN
2     John   37       NaN
3  Sabrina   25       NaN
4    Tyler   28  Swimming
5  Natalie   39   Reading

Outer does not consider any differences in columns between two dataframe. Because df3 does not have a hobby column, pandas will automatically fill them with null values.

In [8]:
# Inner stacks only the columns that are shared between the two dataframes

pd.concat([df3, df4], join = 'inner', ignore_index = True)

      Name  Age
0    Vicky   12
1     Bill   46
2     John   37
3  Sabrina   25
4    Tyler   28
5  Natalie   39

Because df3 does not have the hobby column, pandas will not show that column in the combined dataframe.

# Merge

To demonstrate the idea of merge, let's first create two samples dataframe of a retail store. One for sales data and one for customer profile.

In [9]:
from datetime import date, timedelta

startingDate = date(2019, 7, 1)
endingDate = date(2020, 6, 30)
diff = endingDate - startingDate

dates = []
for k in range(diff.days + 1):
    dates.append(startingDate + timedelta(days = k))
    
lifestage = ['Young Adults', 'Family', 'Senior']
stores = ['Melbourne CBD', 'Carlton', 'Fitzroy', 'Collingwood', 'Richmond', 'Doncaster', 'Kew', 'Prahran', 'South Yarra', 'Docklands', 'Bundoora', 'Ivanhoe', 'Glen Waverly', 'Dandenong', 'Frankston']

In [10]:
# Create two dataframes, one for sales and one for customer profile

import random
import datetime

sales = pd.DataFrame({'Date': random.choices(dates, k = 1000), 'Customer ID': random.choices(list(range(1, 101)), k = 1000), 'Store': random.choices(stores, k = 1000), 'Sales': random.choices(list(range(1, 101)), k = 1000)})
customers = pd.DataFrame({'Customer ID': list(range(1, 101)), 'Customer Lifestage': random.choices(lifestage, k = 100)})

# Let's look at sales
sales.head()

         Date  Customer ID          Store  Sales
0  2019-11-03           38  Melbourne CBD     59
1  2019-11-17           76  Melbourne CBD     63
2  2019-12-14           12        Fitzroy     57
3  2019-09-21           67        Prahran     43
4  2020-03-02           87            Kew     88

In [11]:
# Date is not in order so sort data by date

sales.sort_values(by = 'Date', inplace = True, ignore_index = True)
sales.head()

         Date  Customer ID      Store  Sales
0  2019-07-01           70  Frankston      8
1  2019-07-01           56  Docklands     38
2  2019-07-02           27  Doncaster      3
3  2019-07-02           40        Kew     43
4  2019-07-03           56        Kew     18

In [12]:
# Shape of sales dataframe

sales.shape

(1000, 4)

In [13]:
# Let's look at customers

customers.head()

   Customer ID Customer Lifestage
0            1             Senior
1            2             Family
2            3             Family
3            4       Young Adults
4            5       Young Adults

In [14]:
# Shape of customers shape, there are 100 rows and 2 columns

customers.shape

(100, 2)

In [15]:
# There are 100 unique customer ID which means that they are unique to each row

customers['Customer ID'].nunique()

100

In [16]:
# Select sales made by customer with customer ID number 1

sales.loc[sales['Customer ID'] == 1, :].head()

           Date  Customer ID      Store  Sales
386  2019-11-25            1  Docklands     79
610  2020-02-17            1    Carlton     26
731  2020-03-30            1   Richmond      6
854  2020-05-10            1  Frankston     60
855  2020-05-11            1  Doncaster     33

In [17]:
# Merge the two dataframes together

combined = pd.merge(customers, sales)
combined.head()

   Customer ID Customer Lifestage        Date      Store  Sales
0            1             Senior  2019-11-25  Docklands     79
1            1             Senior  2020-02-17    Carlton     26
2            1             Senior  2020-03-30   Richmond      6
3            1             Senior  2020-05-10  Frankston     60
4            1             Senior  2020-05-11  Doncaster     33

In [18]:
print("Shape of sales data is: ", sales.shape)
print("Shape of customer data is: ", customers.shape)
print("Shape of the combined dataframe is: ", combined.shape)

Shape of sales data is:  (1000, 4)
Shape of customer data is:  (100, 2)
Shape of the combined dataframe is:  (1000, 5)

As we can see, merge has successfully joined the two dataframes together based on a shared column which is customer ID.

The combined dataframe has the same number of rows as the sales dataframe but with an additional column, customer lifestage which came from the customer dataframe.

Now, we are going to explore the how argument within the merge function which allows you to specify the direction in which you would like to merge your dataframes.

In [21]:
size = pd.DataFrame({'Colour': ['Red', 'Blue', 'Green'], 'Size': ['M', 'S', 'M']})
gender = pd.DataFrame({'Colour': ['Red', 'Blue', 'Yellow'], 'Sex': ['Female', 'Female', 'Male']})
size

  Colour Size
0    Red    M
1   Blue    S
2  Green    M

In [22]:
gender

   Colour     Sex
0     Red  Female
1    Blue  Female
2  Yellow    Male

Inner and outer are very similar to what we have seen in the concat section earlier in this notebook.

In [23]:
# Only show rows where there is a match in the column
# Red and blue are present in both dataframes

pd.merge(size, gender, how = 'inner')

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female

In [24]:
# Show all the rows and fill rows with null values when there is no match
# There is no sex info on green colour and there is no size info on yellow colour

pd.merge(size, gender, how = 'outer')

   Colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2   Green    M     NaN
3  Yellow  NaN    Male

Left and right on the other hand allows you to specify which dataframe to keep when there is no matching rows.

In [23]:
# Keep everything that is on the left dataframe which is df1 in this example
# Fill in sex info for rows that have matches with df2 and if there is none e.g. green colour, fill null value

pd.merge(size, gender, how = 'left')

  Colour Size     Sex
0    Red    M  Female
1   Blue    S  Female
2  Green    M     NaN

In [25]:
# Keep everything that is on the right dataframe which is df2 in this example
# Fill in size info for rows that have matches with df1 and if there is none e.g. yellow colour, fill null value

pd.merge(size, gender, how = 'right')

   Colour Size     Sex
0     Red    M  Female
1    Blue    S  Female
2  Yellow  NaN    Male